# https://matthiasportzel.com/brewfile/
# https://docs.brew.sh/Brew-Bundle-and-Brewfile

def noUpdate(&block)
  ENV["HOMEBREW_NO_AUTO_UPDATE"]="1"
  block.call
  ENV.delete("HOMEBREW_NO_AUTO_UPDATE")
end

brew "jq"
brew "yq"
brew "ripgrep"
brew "curl"
brew "ast-grep"
brew "gh"
brew "hyperfine"
brew "tldr"
brew "git"
brew "volta"
brew "mas"
brew "nushell"

cask "lunar"
cask "gimp"
cask "git-credential-manager"

### Self updating

noUpdate do 
  cask "iterm2"
  cask "obsidian"
  cask "visual-studio-code"
  cask "google-chrome"
  cask "spotify"
end

if ENV["PERSONAL"]
  cask "vlc"

  noUpdate do 
    cask "notion"
  end

  # Outdated, install v8 from website: https://1password.com/downloads/mac
  # mas "1Password", id: 1333542190
  mas "Todoist", id: 585829637
  mas "WhatsApp Messenger", id: 310633997
  mas "1Blocker", id: 1365531024
  mas "Paprika Recipe Manager 3", id: 1303222628
end
